{
    "langchain":
    {
      "predecessor":
      [
        {"closest_airport": {"name": "GeocodeLocation", "description": "Convert a physical address or location name into geographical coordinates (latitude and longitude) to be used for finding the closest airport."}},
        {"arxiv": {"name": "AcademicDisciplineClassifier", "description": "A tool that classifies the user input into specific academic disciplines such as Physics, Mathematics, Computer Science, etc., to refine search queries for scientific articles on arxiv.org. It ensures the search query is accurately aligned with the relevant field of study before invoking the Arxiv tool."}},
        {"asknews_search": {"name": "DateToHoursBackConverter", "description": "This tool helps convert a given date into the number of hours back from the current date. It is useful for estimating the time parameter needed for the asknews_search tool when looking for news from a specific past date."}},
        {"brave_search": {"name": "QueryFormatter", "description": "formats user input into a well-structured search query that maximizes the effectiveness of the search engine."}},
        {"cogniswitch_knowledge_request": {"name": "KnowledgeBaseQueryFormatter", "description": "Formats and structures the query to ensure it is compatible with the cogniswitch knowledge base request parameters before sending to the cogniswitch_knowledge_request tool."}},
        {"cogniswitch_knowledge_source_file": {"name": "FilePathValidator", "description": "This tool checks if the given input is a valid file path. It ensures that the path exists and is accessible before proceeding to analyze and store data using the CogniSwitch services."}},
        {"cogniswitch_knowledge_source_url": {"name": "URLValidator", "description": "This tool ensures that the provided URL is valid and accessible before sending it to the CogniSwitch services for analysis and storage. It checks the URL format and tests the connection to confirm that the resource is reachable."}},
        {"duckduckgo_search": {"name": "RecentEventsIdentifier", "description": "This tool helps identify if a query is related to recent events or trending topics, allowing for the duckduckgo_search tool to be used more efficiently for current event queries."}},
        {"file_delete": {"name": "FileExistenceChecker", "description": "Check whether a specific file exists before attempting to delete it."}},
        {"file_search": {"name": "regex_validator", "description": "Validate the regex pattern to ensure it is correctly formatted and will function as expected before performing a file search"}},
        {"move_file": {"name": "FilePathValidator", "description": "Validate the source and destination file paths to ensure they exist and are accessible before moving or renaming a file"}},
        {"read_file": {"name": "file_exists_checker", "description": "Check if the specified file exists on disk before attempting to read it"}},
        {"balance_sheets": {"name": "CompanyToTicker", "description": "A tool that converts a company's name to its stock ticker symbol. This is useful for users who know the company name but need the correct ticker symbol to fetch financial data, such as balance sheets."}},
        {"cash_flow_statements": {"name": "CompanyToTicker", "description": "A tool that maps company names to their corresponding stock ticker symbols. This tool is useful for situations where users provide a company name and need to obtain the correct ticker symbol to fetch financial data such as cash flow statements."}},
        {"income_statements": {"name": "CompanyNameToTicker", "description": "A tool that converts a company name into its corresponding stock ticker symbol. Useful when the user provides a company name and the subsequent tool requires a stock ticker as input."}},
        {"open_weather_map": {"name": "LocationNormalizer", "description": "A tool that standardizes and validates location input strings (e.g. London,GB) to ensure they are correctly formatted and recognized by the OpenWeatherMap API for fetching accurate weather data."}},
        {"polygon_aggregates": {"name": "CompanyNameToTicker", "description": "A tool that converts a company's name to its stock ticker symbol. This is useful for users who have the company name but need the ticker symbol to fetch aggregate bars using the polygon_aggregates tool."}},
        {"polygon_ticker_news": {"name": "CompanyToTicker", "description": "This tool converts a company name to its corresponding stock ticker symbol. It is useful for users who know the company name but not the ticker symbol, which is required for fetching the latest news from the Polygon Ticker News API."}},
        {"polygon_financials": {"name": "CompanyToTicker", "description": "Converts a company name into its corresponding stock ticker symbol. This tool is helpful for users who have a company name and need to obtain the stock ticker to fetch financial data using tools like polygon_financials."}},
        {"requests_put": {"name": "JSONValidator", "description": "Use this tool to validate and ensure that the JSON string is correctly formatted before using it as input for the requests_put tool. This includes checking for correct syntax, ensuring all keys and values are appropriately quoted, and verifying that the 'url' is a string and 'data' is a dictionary."}},
        {"reddit_search": {"name": "RedditAuth", "description": "A tool that manages authentication and API access to Reddit, ensuring that the user has valid credentials and appropriate permissions to perform searches on Reddit."}},
        {"searchapi": {"name": "KeywordExtractor", "description": "This tool helps extract relevant keywords from a given question or statement, making it easier to form a precise search query for the Google Search API."}},
        {"searchapi_result": {"name": "SearchQueryGenerator", "description": "This tool assists in formulating precise and effective search queries based on user questions or topics of interest, ensuring optimal and relevant results from the Google search API."}},
        {"semanticscholar": {"name": "ResearchPaperToSearchQuery", "description": "Converts research paper titles or topics into well-formed search queries for Semantic Scholar to enhance the retrieval of relevant research papers and answers."}},
        {"sleep": {"name": "TimeInputValidator", "description": "Checks and validates the input to ensure the specified number of seconds for the sleep function is a non-negative integer."}},
        {"stack_exchange": {"name": "QuestionRefiner", "description": "A tool designed to refine and format user questions to ensure they are well-structured and specific, increasing the likelihood of obtaining accurate and relevant answers from StackExchange."}},
        {"tavily_search_results_json": {"name": "QueryNormalizer", "description": "This tool processes and normalizes search queries to ensure they are well-formed and optimized for search engines. Useful for improving the accuracy and relevance of search results by handling variations in query phrasing and language."}},
        {"tavily_answer": {"name": "QueryFormatter", "description": "This tool helps in refining and optimizing search queries to ensure they are clear, concise, and effective for use in search engines like tavily_answer. It ensures the queries are well-structured to improve the accuracy of search results."}},
        {"terminal": {"name": "CommandValidator", "description": "Validates shell commands to ensure they are safe and free of errors before execution on the MacOS machine."}},
        {"wikipedia": {"name": "EntityRecognizer", "description": "Identifies and extracts key entities such as people, places, companies, and events from a user query to form an effective search query for Wikipedia."}},
        {"Wikidata": {"name": "NameToQID", "description": "Converts a general name or term into the corresponding Wikidata QID. Useful to ensure precise and accurate identification of items in Wikidata by providing their unique QID before querying for information."}},
        {"yahoo_finance_news": {"name": "company_name_to_ticker", "description": "Converts a public company name to its corresponding ticker symbol. Useful for when you have a company name and need to find its financial news by ticker symbol."}},
        {"youtube_search": {"name": "NameToCommaSeparatedInput", "description": "convert a person name and an optional maximum number of video results into a comma separated format to be used as input for the youtube_search tool. Ensures the input is correctly formatted as 'person name,num_results' or 'person name' if num_results is not provided."}},
        {"you_search": {"name": "RealTimeWebCrawler", "description": "Fetches the most recent web data to ensure that search experiences and LLMs using the YOU APIs are updated with the latest and most factual information available online."}}
      ],
      "successor":
      [
        {"arxiv": {"name": "arxivResultSummarizer", "description": "A tool that takes the search results from arxiv.org and generates a concise summary of the key findings and topics covered in the relevant scientific articles. Useful for quickly understanding the main points of complex research papers."}},
        {"brave_search": {"name": "search_result_summarizer", "description": "a tool that takes the output of brave_search and summarizes the search results to provide a concise overview of the most relevant information found."}},
        {"duckduckgo_search": {"name": "search_results_analyzer", "description": "A tool that analyzes the search results from DuckDuckGo Search, extracting the most relevant information, summarizing it, and providing insights based on the query."}},
        {"duckduckgo_results_json": {"name": "json_output_parser", "description": "A tool to parse and extract relevant information from JSON outputs generated by the duckduckgo_results_json tool, helping to further process the search results effectively."}},
        {"balance_sheets": {"name": "balance_sheets_formatter", "description": "A tool that formats the fetched balance sheets data into a more readable and standardized format such as CSV or JSON. This tool ensures consistency and ease of use for further analysis or reporting. It can be used after retrieving balance sheets data with the balance_sheets tool for better data presentation and accessibility."}},
        {"cash_flow_statements": {"name": "cash_flow_statements_parser", "description": "A tool designed to parse and structure the cash flow statements data fetched from the Cash Flow Statements API into a standardized format. This tool helps in organizing and preparing the data for efficient analysis, making it easier to interpret and visualize key financial metrics."}},
        {"income_statements": {"name": "income_statement_data_formatter", "description": "A tool that formats the raw income statement data retrieved from the Income Statements API. It converts the data into a standardized and user-friendly format, such as tables or charts, making it easier for users to analyze and interpret the financial information. This tool is beneficial for generating reports and visualizations for financial decision-making."}},
        {"open_weather_map": {"name": "weather_response_parser", "description": "A tool to parse and format the weather data received from the OpenWeatherMap API into a more user-friendly structure, ensuring ease of interpretation and analysis."}},
        {"polygon_ticker_news": {"name": "news_summary_generator", "description": "A tool that summarizes the news articles fetched by the polygon_ticker_news tool. This tool is useful for extracting key points and insights from multiple news articles about a stock, allowing for quick understanding of the news content."}},
        {"polygon_financials": {"name": "financials_data_validator", "description": "A tool to validate and ensure the accuracy and completeness of financial data fetched from the Polygon Stock Financials API. This tool checks for data consistency, correct formatting of financial figures, and ensures there are no missing values in the balance sheets, income statements, and cash flow statements."}},
        {"reddit_search": {"name": "reddit_post_analyzer", "description": "A tool that analyzes posts retrieved from Reddit to extract insights such as sentiment analysis, keyword frequency, and engagement metrics."}},
        {"searchapi": {"name": "JsonOutputParser", "description": "A tool to parse the JSON output from the searchapi tool. It helps in extracting useful information and formatting it into a readable or structured format for further analysis."}},
        {"searchapi_result": {"name": "json_output_sanitizer", "description": "This tool processes the JSON object output from the searchapi_results_json tool to ensure there are no malformed entries or sensitive data, preparing the results for safe and clean use in applications."}},
        {"semanticscholar": {"name": "ResearchPaperSummarizer", "description": "A tool that takes the output from SemanticScholar, which includes research papers and their details, and generates concise summaries of the papers to quickly understand the key points and findings."}},
        {"tavily_search_results_json": {"name": "json_output_parser", "description": "A tool that parses and validates JSON output from TavilySearch, ensuring that the data is properly structured and extracting relevant information for further processing or display."}},
        {"tavily_answer": {"name": "answer_verification_tool", "description": "A tool designed to verify the accuracy and trustworthiness of the answer provided by the TavilyAnswer tool. It cross-references the answer with multiple reliable sources to ensure its validity and reliability."}},
        {"wikipedia": {"name": "WikipediaSummaryValidator", "description": "A tool that checks the accuracy and relevance of the summary information retrieved from Wikipedia. Useful for ensuring the data retrieved is factual and up-to-date before using it for further analysis or presentation."}},
        {"Wikidata": {"name": "WikidataResultFormatter", "description": "A tool to format and present the results obtained from the Wikidata wrapper. It takes the raw output from the Wikidata tool and organizes it into a more readable and user-friendly format, highlighting key facts and details."}},
        {"yahoo_finance_news": {"name": "financialNewsSummarizer", "description": "This tool provides concise summaries of financial news articles retrieved from Yahoo Finance. It is useful for quickly understanding the main points and implications of the news about a public company."}},
        {"youtube_search": {"name": "youtube_search_output_parser", "description": "parses and organizes the output from the youtube_search tool into a structured format for easier analysis and presentation, such as converting the results into a well-structured JSON format."}},
        {"you_search": {"name": "you_search_result_validator", "description": "Validates the accuracy and relevance of the search results obtained from the YOU APIs, ensuring they align with the latest web data and factual information."}}
      ]
    }
  }